[
  {
    "name": "Cliff Goodchild OAM",
    "year": "1958",
    "summary": "(Founder WBBMB, Aust EEb Tuba 1945 Champion, Orchestral Performer)  Cliff Goodchild OAM (1926–2008)  was a towering figure in Australian brass music and music education, whose legacy continues to influence generations of musicians. \n \n Additionally, Waverley College, where Cliff dedicated over 45 years to music education, renamed its Senior Concert Band as the Cliff Goodchild Concert Band in his honor. Cliff's legacy lives on through the countless musicians he mentored, the institutions he established, and the vibrant musical culture he helped cultivate in Australia. \n \n With the Sydney Symphony Orchestra, Goodchild was soloist in the Vaughan Williams Tuba Concerto several times because it was the only well-known work for the instrument. In 1975 William Lovelock wrote his Quintet for him, using his initials CDG as its theme, which expanded the available repertoire a little. Goodchild loved to tell stories about his days in the symphony orchestra, including the one about the time a conductor wanted the tuba muted. Tuba mutes did not exist in Australia then, so the conductor tried a kitchen colander. He put it in the bell of Goodchild's tuba, where it rattled unbearably and was judged a failure. Eventually, Goodchild got a proper mute from overseas; it looked \"like a Cape Canaveral rocket \" but it worked. interesting read @ https://www.smh.com.au/national/bold-as-brass-in-pushing-the-bands-20080802-gdsoq6.html ",
    "url": "https://sites.google.com/view/bondibrasssydney/our-founder"
  },
  {
    "name": "Monnie Goodchild",
    "year": "1958",
    "summary": "(WBBMB Hostess 50+yrs and ASBOF Hero)",
    "url": ""
  },
  {
    "name": "Paul GoodChild",
    "year": "1966",
    "summary": "( Extraordinary Soloist Musican(Tpt),Assoc Prin Tpt SSO/Sydney Brass/Music Educator/Conductor Paul Goodchild (1960 – 2022) was a distinguished Australian trumpeter whose career spanned over four decades. He was renowned for his exceptional musicianship, dedication to music education, and significant contributions to both professional and community music ensembles in Australia. \nCommitted to nurturing the next generation of musicians, Paul taught at the Sydney and Newcastle Conservatoriums and conducted masterclasses across Australia and internationally. He was instrumental in mentoring young brass players, many of whom have pursued successful careers in music. \nPaul's impact extended beyond performance and education. He served as a Board Director for the Australian School Band and Orchestra Festival (ASBOF), an event founded by his father in 1962, which has grown to become Australia's largest school music festival. \nHis dedication to music and community was celebrated in 2019 when the Sydney Symphony Orchestra honored his 40-yeer Australain milestone with a special concert featuring Lovelock’s Trumpet Concerto.",
    "url": "https://sites.google.com/view/bondibrasssydney/vale-paul-goodchild"
  },
  {
    "name": "Peter Kelly/Delmae",
    "year": "1966",
    "summary": "(Numerous Pro Shows & recording of Top 10 UK Pop Chart\n \n \"You're a lady (1972) Peter Skellern peaked @ #3 in Top Ten Charts Uk #3 in Australia \")/ \n \nDelmae(Wife)  ASBOF hero",
    "url": "https://www.youtube.com/watch?v=U-hNZ5ichrE"
  },
  {
    "name": "John Tesserio",
    "year": "1966",
    "summary": "( Tess) ASBOF hero",
    "url": ""
  },
  {
    "name": "Chris Blenkinsopp",
    "year": "1966",
    "summary": "(Music Educator/Conductor) Botany Band Chris Blenkinsopp is an Australian music educator and conductor based in Sydney, with a strong background in brass performance and ensemble leadership. He has been actively involved in music education and performance for several decades.",
    "url": ""
  },
  {
    "name": "Mathias Rogala-Koczorowski",
    "year": "1966",
    "summary": "(Music Educator/Conductor) Mathias is a multifaceted figure in New South Wales, Australia, known for his contributions to music, environmental advocacy, and community engagement. \n Mathias has had a significant impact on the Australian music scene. He served as the conductor of the UNSW Wind Symphony from 2004 to 2006, leading performances that enriched the university's cultural life . Additionally, he conducted the Bathurst City and RSL Concert Band, with documented performances dating back to at least 1992 . His leadership in these ensembles has been instrumental in promoting wind band music in the region. \n Mathias has had a significant impact on the Australian music scene. He served as the conductor of the UNSW Wind Symphony from 2004 to 2006, leading performances that enriched the university's cultural life . Additionally, he conducted the Bathurst City and RSL Concert Band, with documented performances dating back to at least 1992 . His leadership in these ensembles has been instrumental in promoting wind band music in the region, His diverse contributions have been formally recognized; he was honored with the Medal of the Order of Australia (OAM) in the Creative/Performing Arts/Cultural/Education category by the Bathurst Regional Council, acknowledging his significant impact on the community  \n \n Mathias has also appeared on national television. In June 2019, he was featured on Channel 10's \"The Project,\" where he was celebrated for his resilience and contributions to the community, especially following a heart transplant.",
    "url": ""
  },
  {
    "name": "Geoff Embleton",
    "year": "1966",
    "summary": "Only Australian Member of the George Formby Society(UK) Price of Wales Theatre (london) Radio show,Sydney Entertainer. Also known as Geoffrey Ogden-Brown, is an Australian actor and public figure with a diverse background in entertainment and hospitality. \n Under the name Geoffrey Ogden-Brown, he is known for his role as the Band Leader in the 1997 film Paradise Road, which portrays the experiences of women in a Japanese internment camp during World War II.\n He also appeared as a contestant on the Australian quiz show Hard Quiz in 2018, where he was featured as an expert on the 1963 film The Great Escape. \n Overall, Geoffrey Ogden-Brown, aka Geoff Embleton, has a multifaceted career spanning acting, hospitality, and music.",
    "url": ""
  },
  {
    "name": "Philippa Conway",
    "year": "1966",
    "summary": "Performer married Don Radar Mancini Orchestra by Raymond Hanson (1972)  \n\n Tuba in All female Big band LA/USA \n https://www.australianmusiccentre.com.au/workversion/hanson",
    "url": "https://static1.squarespace.com/static/58bf64e6c534a5e3ac61401d/t/5be98999032be4540ec9df51/1542031820560/Jazz+Downunder+July+1975.pdf"
  },
  {
    "name": "Brian Evans",
    "year": "1968",
    "summary": "ITG president for 3 yrs ( worldwide) / Opera Australia Orchestra 40+ yrs Brian is a distinguished Australian trumpeter, lyric tenor, educator, and advocate, whose multifaceted career spans over five decades. He is renowned for his dual proficiency in trumpet and voice, often performing both roles in the same concert—a rarity in the classical music world. Brian began his brass journey at age 12, initially on tenor horn, before transitioning to trumpet. In 1975, he joined the Australian Opera and Ballet Orchestra (AOBO) as second trumpet, ascending to principal third trumpet/cornet in 1983. Over his 45-year tenure, he performed in over 140 operatic and ballet works, collaborating with esteemed conductors such as Sir Charles Mackerras, Richard Bonynge, and Simone Young. \nHe is the founding and current president of the Australian Trumpet Guild (ATG) and has held multiple leadership roles within the International Trumpet Guild (ITG), including president from 2015 to 2017. Evans has presented lectures and masterclasses globally, including at the Beijing Central Conservatory and the Kunitachi College of Music in Tokyo. Brian's  enduring contributions to performance, education, and advocacy have solidified his status as a luminary in the brass",
    "url": "./images/evans_brian_ITG2023.pdf"
  },
  {
    "name": "Michael Cleary",
    "year": "1968",
    "summary": "( Daly Wilson Big Band, Channel Nine Band, Jesus Christ Superstar/Marcia Hines) Mike is an Australian trumpet player known for his contributions to the country's music scene, particularly during the 1970s and 1980s. His work spans various genres, including rock, funk, soul, and jazz. Cleary's trumpet playing is featured on several notable Australian albums:\nBilly Thorpe – Million Dollar Bill (1975): Cleary contributed trumpet parts to this album, which blends rock, funk, and soul. \nMarcia Hines – Live Across Australia (1978): He performed on this live double LP, showcasing Hines' dynamic stage presence.\nPaul Kelly and the Coloured Girls – Gossip (1986): Cleary's trumpet work is part of this critically acclaimed album, which helped establish Kelly's reputation.\nWikipedia\nAdditionally, Michael  played with ensembles such as the Australian Country Brass All-Stars and Geoff Harvey and The Midday Show Band, indicating his versatility across different musical styles",
    "url": ""
  },
  {
    "name": "Steve Nolan",
    "year": "1968",
    "summary": "Police Band",
    "url": ""
  },
  {
    "name": "Laurie Liskowski",
    "year": "1969",
    "summary": "(Music Educator/Orchestral performer Fr.Horn)",
    "url": ""
  },
  {
    "name": "David Clarence",
    "year": "1972",
    "summary": "(World Renowned Percussionist) Opera Australia Orchestra 40+ yrs David Clarence is a seasoned Australian timpanist who has held the position of Principal Timpani with the Opera Australia Orchestra (formerly the Australian Opera and Ballet Orchestra) since 1986. His tenure with the orchestra has spanned nearly four decades, contributing to its extensive repertoire of opera, ballet, and concert performances",
    "url": ""
  },
  {
    "name": "Kel Bakewell",
    "year": "1972",
    "summary": "Minister of Arts of the Band Kelvin \"Kel\" Bakewell is a cherished member of the Bondi Brass community, having joined the band at the age of 12. His musical roots run deep, being the grandnephew of Frank Coughlan, one of Australia's most esteemed jazz musicians. Kel's grandfather, Frank Coughlan's brother, played in the Newcastle Steelworks Band, which achieved international acclaim by winning three consecutive World Championships. This rich musical heritage has undoubtedly influenced Kel's lifelong dedication to brass music .\nBeyond his performances, Kel has been a steadfast volunteer for the Australian School Band and Orchestra Festival (ASBOF) since his early teens. His commitment to nurturing young musicians and supporting the broader Sydney band movement has made him a stalwart figure in the community .\n\nProfessionally, Kel worked for the NSW State Treasury after leaving school and later for the Department of Liquor, Gaming and Racing until his retirement. Known affectionately as the band's \"spiritual advisor,\" his passion for music remains evident. He continues to play the cornet and has expressed contentment with his current instrument, humorously noting that he's never owned a new trumpet but is happy with the one he has .\nASBOF\n\nKel's enduring presence and contributions to Bondi Brass and the wider musical community exemplify his unwavering dedication and passion for brass music",
    "url": ""
  },
  {
    "name": "Douglas Ross",
    "year": "1976",
    "summary": "Navy Band",
    "url": ""
  },
  {
    "name": "Tom Campbell",
    "year": "1976",
    "summary": "(ASBOF MC 20yrs+)",
    "url": ""
  },
  {
    "name": "Louis Goodchild",
    "year": "1978",
    "summary": "ASBOF Secretary/Legal 10+ years",
    "url": ""
  },
  {
    "name": "Mark Elphick",
    "year": "1978",
    "summary": "( Warren Daly Band) coming back to sydney in 2027",
    "url": ""
  },
  {
    "name": "Bernhard Leuthold",
    "year": "1978",
	    "summary": "(Music Educator/Performer)  An Alpine Hornist & French horn player based now in Bern,Switzerland, Bernard performed  WBBB circa 1980. He was also known as an enthusiastic alphorn player, having demonstrated the instrument to the band . While his classical horn work is less documented in major orchestral annals, this mention highlights his involvement in local music circles and the coupling of the two 'horn' traditions. \n The alphorn  is a traditional wooden wind instrument from the Swiss Alps, made of spruce or pine and typically 3–3.5 meters long. \n Originally used by shepherds for signaling in the mountains, driving cattle, or even calling evening prayers in areas without church bells . \n  It produces natural tonality from the harmonic series—usually restricted to limited pitches, though experienced players may manage up to three octaves.\n He is Curator of Brass Museum in Bern Switzerland, a must see if travelling there",
    "url": "https://www.myswitzerland.com/en-au/experiences/klingendes-museum-bern/"
	},
  {
    "name": "Genevieve Campbell",
    "year": "1978",
    "summary": "(Music Educator/Conductor /Performer)",
    "url": ""
  },
  {
    "name": "Anne Clarence",
    "year": "1980",
    "summary": "Performer ( French Horn) AustOpera Wife of David Clarence",
    "url": ""
  },
  {
    "name": "Jeff Segal",
    "year": "1980",
    "summary": "(Music Educator/Performer) Principal Trp Lausanne Orchestra Sydney Con;studied under Prof  Håkan Hardenberger ( Sweden) /Edwin Tarr. He served as principal trumpet for both the Tonhalle Orchestra in Zurich and the Lausanne Chamber Orchestra. His performances extended across Europe and the United States, both as a soloist and chamber musician. He was also a member of various brass quintets and baroque trumpet ensembles. Segal's discography includes notable recordings such as The Art of the Baroque Trumpet, Volume 5: An Italian Concert, and collaborations with the Tonhalle-Orchester Zürich under conductor David Zinman, featuring works by Haydn and Hummel.\nSegal also maintains a YouTube channel, Wenn Schon Denn Schon, where he conducts interviews with individuals who have influenced and inspired him",
    "url": "https://www.youtube.com/channel/UColyVFy3vnVKvdsjtUdE2AQ"
  },
  {
    "name": "Tom Burge",
    "year": "1980",
    "summary": "( Julliard New York, Orchestral performer,Prestigious Trombone US Award winner) Tom  began his musical journey in Australia, earning a Bachelor of Music from the Australian National University (ANU). He was awarded a Queen Elizabeth II Award, which enabled him to pursue a Master’s degree at the Juilliard School in New York, where he studied under renowned trombonists Michael Mulcahy and Joseph Alessi",
    "url": ""
  },
  {
    "name": "Pierre Scala",
    "year": "1980",
    "summary": "(Music Educator) Trumpet",
    "url": ""
  },
  {
    "name": "Gareth Jude",
    "year": "1981",
    "summary": "(Music Educator) - Trombone",
    "url": ""
  },
  {
    "name": "Sergio Barca",
    "year": "1982",
    "summary": "(Music Educator)",
    "url": ""
  },
  {
    "name": "Don Shearman",
    "year": "1984",
    "summary": "( ASBOF Director) Don Shearman is a longstanding figure in Australian music education, particularly through his role with the Australian School Band and Orchestra Festival (ASBOF). He serves as a Director on ASBOF's Board, contributing to the festival's mission of fostering musical development among school ensembles across Australia. With over four decades of involvement in community music organizations, Shearman has also worked as a high school band director, mentoring numerous students, some of whom have pursued professional careers in music",
    "url": ""
  },
  {
    "name": "Andrew Blenkinsopp",
    "year": "1984",
    "summary": "( Music Educator/Conductor) Inner West Orchestra",
    "url": ""
  },
  {
    "name": "Pat Devery",
    "year": "1986",
    "summary": "(ASBOF CEO 10000 kids/pa 300 bands) Pat Devery is a prominent figure in Australian music education, serving as the General Manager and a Director of the Australian School Band and Orchestra Festival (ASBOF). His association with the festival dates back to 1985, reflecting a long-standing commitment to nurturing school-based instrumental music programs across the country.",
    "url": ""
  },
  {
    "name": "Tadahisa Motooka",
    "year": "2000",
    "summary": "( ASBOF, Musician Tokyo, Japan)",
    "url": ""
  },
  {
    "name": "Chuan Hai Wan",
    "year": "2010",
    "summary": "(Music Educator/Conductor) Chuan Hai Wan is a seasoned trumpet and brass educator based in Sydney, Australia, with a substantial background in both performance and teaching. He holds a Bachelor of Performance from the Sydney Conservatorium of Music, where he studied trumpet under Paul Goodchild (Associate Principal Trumpet, Sydney Symphony Orchestra) and Andrew Evans (Chair of Brass Unit at the Conservatorium). Additionally, he studied conducting with Henryk Pisarek during his time at the Conservatorium",
    "url": ""
  },
  {
    "name": "Tim Neville",
    "year": "2010",
    "summary": "(Music Educator)",
    "url": ""
  },
  {
    "name": "Marco Stroppel",
    "year": "2010",
    "summary": "Musician  - Germany - Initial Webmeister",
    "url": ""
  },
  {
    "name": "Ellie Shearer",
    "year": "2015",
    "summary": "Trombone ( James Morrison Music Conservatory, Mt Gambier) Ellie Shearer is a distinguished Australian trombonist renowned for her versatility across jazz, classical, and contemporary music genres. A graduate of the Sydney Conservatorium of Music, she studied under esteemed musicians including Dave Panichi, James Greening, and Judy Bailey\nEllie has held lead trombone positions in several prominent ensembles, such as the Australian National Jazz Orchestra (ANJO), Jazzgroove Mothership Orchestra, and Dave Panichi’s Big Band. Her performance credits extend to collaborations with notable artists like Hugh Jackman ( Las Vegas) , Olivia Newton-John, John Farnham, and James Morrison\nHer television appearances encompass performances on The Voice Australia, Dancing with the Stars Australia, and ABC’s The Recording Studio.",
    "url": ""
  },
  {
    "name": "Maddy Shearer",
    "year": "2015",
    "summary": "(Music Educator/Conductor) Maddy Shearer is an accomplished Australian musician, educator, and conductor specializing in low brass and bass guitar. Her multifaceted career spans performance, music education, and leadership within school and community music programs\nMaddy has showcased her talents as a bassist in various musical settings. Notably, she was a member of the indie rock band Trainkids, contributing bass lines alongside bandmates Max Fricker, Hugo Smart, and William Shreeve. The group gained recognition on Triple J Unearthed, highlighting their unique blend of genres and musical creativity.\nMaddy has a Masters from Royal School Music London\nMaddy's expertise extends to adjudication and mentorship. She has been involved with the Australian School Band and Orchestra Festival (ASBOF), serving as a conductor for participating ensembles. \nHer leadership is further recognized through her role as a committee member of the Australian Band and Orchestra Directors' Association (ABODA) NSW, where she contributes to the advancement of music education across the region. \nMaddy Shearer's dynamic career reflects her passion for music and dedication to nurturing the next generation of musicians. Her contributions continue to enrich Australia's musical landscape.",
    "url": ""
  },
  {
    "name": "Tom Cuk",
    "year": "2017",
    "summary": "Varios Sydney Productions, President BondiBrass Extraordinaire",
    "url": ""
  },
  {
    "name": "Logan Birchall",
    "year": "2017",
    "summary": "(Music Educator/Conductor) Logan  is an accomplished Australian trumpet player, music educator, and arts administrator based in Sydney. His journey from rural beginnings to prominent roles in the city's music scene highlights his dedication and versatility. His efforts continue to inspire and contribute to the Australian musical landscape.",
    "url": ""
  },
  {
    "name": "Panagiotis Karamanos  (Pani)",
    "year": "2017",
    "summary": "(Music Educator/Conductor) Panagiotis Karamanos, often known as Pani, is a Greek-Australian conductor, educator, and multi-instrumentalist based in Sydney. Born in Athens and raised in Australia from infancy, he has cultivated a dynamic career that bridges performance, education, and orchestral leadership. In 2015, Karamanos founded The Modést Orchestra, a Sydney-based ensemble dedicated to delivering high-quality performances that blend enjoyment with artistic excellence. The orchestra's name pays homage to Modest Mussorgsky",
    "url": ""
  },
  {
    "name": "Megan Lipworth",
    "year": "2021",
    "summary": "(Music Educator/Conductor) Megan 'Meg' Lipworth is a multifaceted Australian musician, conductor, and educator based in Sydney. While her primary instrument is percussion, she is also proficient in piano, clarinet, guitar, ukulele, and jazz vibraphone . Her extensive career encompasses performance, music education, and children's entertainment. \n Meg is actively involved with the Sydney Youth Orchestras and has conducted at events like the Bellingen Youth Orchestra Camp . She is also a committee member of the Australian Band and Orchestra Directors Association (ABODA) NSW. Beyond classical music, Meg is a founding member and lead vocalist of Tiptoe Giants, an award-winning Australian children's music group. The group was nominated for the 2020 ARIA Award for Best Children's Album for their album 'Colour the World' \n Meg is also recipient of the 2022 Cliff Goochild Music Award.",
    "url": ""
  },
  {
    "name": "Rod Herbert",
    "year": "2023",
    "summary": "(Music Composer/Educator/Conductor) Rod Herbert is a seasoned Australian trombonist, educator, and composer based in Sydney. Since 1988, he has been active in the local music scene, performing across genres including jazz, classical, funk, Latin, and musical theatre. He is also the founder of Big Sound Music, a platform offering brass tuition, original compositions, and educational resources for students and teachers.\nThrough Big Sound Music, Herbert offers a range of educational materials, notably the \"Practice Buddies\" series. These play-along MP3s and sheet music sets are designed to aid brass players in developing technique and musicality across beginner to advanced levels. His original compositions for concert bands and jazz ensembles are tailored to various skill levels and have been featured in school performances and festivals.",
    "url": ""
  }
]
